# GroundConductorSizeSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroundConductorSizeSetIterator Class
Members See Also
---
An iterator to a GroundConductorSize set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class GroundConductorSizeSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class GroundConductorSizeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class GroundConductorSizeSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..GroundConductorSizeSetIterator
# See Also
GroundConductorSizeSetIterator Members
Autodesk.Revit.DB.Electrical Namespace